Revit 2027 API
ParameterTypeId.RebarElemHookStartType Property
 "Hook At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarElemHookStartType { get; }
Public Shared ReadOnly Property RebarElemHookStartType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarElemHookStartType {
	ForgeTypeId^ get ();
}
static member RebarElemHookStartType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace